// 1) შექმენით ფუნქცია რომელსაც გადასცემთ მხოლოდ ერთ არგუმენტს number'ს და ასევე შექმენით ერთი ცვლადი i რომელსაც გაიტოლებთ 0'ს შემდეგ while 
// loop ის საშუალებით მიესალმეთ მომხმარებელს იქამდე სანამ i არ გაუტოლდება მომხმარებლის შემოტანილ რიცხვს
function greetUser(number) {
    let i = 0;
    while (i < number) {
        console.log("გამარჯობა მომხმარებელო");
        i++;
    }
}

greetUser(3); // მომხმარებელს მიესალმება 3-ჯერ

// 2) მომხმარებელს შემოატანინეთ რიცხვი 10'ის ფარგლებში ასევე თქვენ შექმენით ცვლადი num სადაც შეინახავთ თქვენთვის სასურველ რიცხვს თუ 
// მომხმარებლის შემოტანილი რიცხვი არ იქნება თქვენი რიცხვის ტოლი მომხმარებელს ახლიდან შემოატანინეთ რიცხვი იქამდე სანამ თქვენს რიცხვს არ დაემთხვევა,
//  დამთხვევის შემთხვევაში მიესალმეთ მომხმარებელს. (გამოიყენეთ switch case)
let num = 7; // ესაა თქვენი არჩეული რიცხვი

let userNumber;

do {
    userNumber = parseInt(prompt("შეიყვანე რიცხვი 1-დან 10-ის ფარგლებში:"));

    switch (userNumber) {
        case 1:
        case 2:
        case 3:
        case 4:
        case 5:
        case 6:
        case 8:
        case 9:
        case 10:
            console.log("არასწორია, სცადე თავიდან");
            break;
        case 7:
            console.log("გილოცავ! სწორია!");
            break;
        default:
            console.log("შეიყვანე მხოლოდ 1-დან 10-ის ფარგლებში");
    }
} while (userNumber !== num);


// 3) შექმენით ფუნქცია სადაც მომხმარებელი შემოიტანს ასაკს თუ ასაკი არ აღემატება 19 მაშინ გამოუტანეთ "თქვენ მიიღეთ 30% ფასდაკლება" თუ ასაკი მეტია
//  ან ტოლი 19 და ნაკლები 50 გამოუტანეთ "თქვენ მიიღეთ 10% ფასდაკლება" და თუ ასაკი აღემატება 50 მაშნ გამოუტანეთ "თქვენ მიიღეთ 50% ფასდაკლება"
function checkDiscount(age) {
    if (age <= 19) {
        console.log("თქვენ მიიღეთ 30% ფასდაკლება");
    } else if (age >= 19 && age < 50) {
        console.log("თქვენ მიიღეთ 10% ფასდაკლება");
    } else if (age >= 50) {
        console.log("თქვენ მიიღეთ 50% ფასდაკლება");
    }
}

checkDiscount(18); // მიიღებს 30%
checkDiscount(25); // მიიღებს 10%
checkDiscount(60); // მიიღებს 50%


// 4) ბევრი ივარჯიშეთ for loop, while loop და switch case ზე