#1)შექმენით ფუნქცია რომელსაც არგუმენტად გადაეცემა ორი რიცხვი შემდეგ კი გამოიტანეთ ამ რიცხვების ჯამი
def sum(a, b):
    total = a + b
    print("the sum of the numbers is:", total)

sum(4, 6)


#2) შექმენით ფუნქცია რომელსაც გადაეცემა არგუმენტად რიცხვი შემდეგ კი მან უნდა დაგვიბრუნოს ლუწია ეს რიცხვი თუ კენტი
def even_or_odd(number):
    if number % 2 == 0:
        print("ლუწია")

    else:
        print("კენტია")

even_or_odd(5)



#3) შექმენით ფუნქცია რომელსაც არგუმენტად გადაეცემა რიცხვი შემდეგ კი მან უნდა დაგვიბრუნოს ეს რიცხვი დადებითია თუ უარყოფითი
def num(number):
    if number > 0:
        print("დადებითია")
    elif number < 0:
        print("უარყოფითია")
    else:
        print("რიცხვი ნულის ტოლია")

num(2)



#4)შექმენით ფუნქცია, რომელსაც არგუმენტად გადაეცემა სახელი და დაბეჭდავს მისთვის მიესალმებას (მაგალითად: "Hello Giorgi"). გამოძახეთ ეს ფუნქცია
#  2-ჯერ და გადაეცით სხვადასხვა სახელი
def greet(name):
    print(f"hello {name}")

greet("gabriel")
greet("nuca")



#5) შექმენით ფუნქცია, რომელიც იღებს ორ სტრინგს და მოახდინეთ კონკატენაცია
def concatination(str1, str2):
    print(str1 + str2 )


concatination("foot", "ball")







