// 1) შექმენით სია რომელშიც შეინახავთ 8 თქვენთვის სასურველ რიცხვს შემდეგ map ფუნქციის გამოყენებით დააბრუნეთ სიის თოთოეული 
// ელემენტი გამრავლებული თავისივე ინდექსზე
var numbers = [3, 5, 7, 2, 9, 4, 6, 8];

function multiplyByIndex(value, index) {
    return value * index;
}

var result = numbers.map(multiplyByIndex);
console.log(result);

// 2) შექმენით სახელების სია და გამოიტანეთ მხოლოდ ლუწ ინდექსზე მდგომი სახელები map ფუნქციის გამოყენებით 


// 3) შექმენით რიცხვების სია სადაც შეინახავთ თქვენთვის სასურველ რიცხვებს შემდეგ map ფუნქციის გამოყენებით გადაუარეთ ამ სიას
//  და დააბრუნეთ კენტ ინდექსზე მდგომი ელემენტების ჯამი 

// 4) შექმენით სახელების სია (შეგიძლიათ გამოიყენოთ წინა დავალებაშ შექმნილი სიაც) შემდეგ filter ფუნქციის გამოყენებით
//  გადაუარეთ სიას და შეამოწმეთ თუ სახელის სიგრძე მეტი იქნება 4 ზე მაშინ დააბრუნეთ true სხვა შემთხვევაში false
var names = ["გიორგი", "ნინო", "ლევანი", "თეა", "მიხეილ", "ანა"];

function longerThan4(name) {
    return name.length > 4;
}

var longNames = names.filter(longerThan4);
console.log(longNames);


// 5) გამოიყენეთ ზემოთ შექმნილი სახელების სია თუ ელემენტი დგას კენტ ინდექსზე მაშინ დააბრუნეთ true სხვა შემთხვევაში 
// false
var names = ["გიორგი", "ნინო", "ლევანი", "თეა", "მიხეილ", "ანა"];

function isOddIndex(value, index) {
    return index % 2 === 1;
}

var indexCheck = names.map(isOddIndex);
console.log(indexCheck);

// 6) კომენტარის სახით ახსენით map და filter ფუნქციები

// map() - გამოიყენება სიაზე გადასავლელად და ამ სიის ელემენტების გასანახლებლად და აბრუნებს ახალ მასივს
// filter() - გამოიყენება სიაზე გადასავლელად და მის გასაფილტრად და აბრუნებს ახალ მასივს