#for loop

#1)გამოიტანეთ რიცხვები 0-დან 10-ის ჩათვლით

for i in range(0,10):
    print(i)
#2)გამოიტანეთ რიცხვები 50-დან 150-მდე

for i in range(50,150):
    print(i)

#3)გამოიტანეთ მხოლოდ ლუწი რიცხვები 200-დან 500-მდე

for i in range(200,500,2):
        print(i)

#4)გამოიტანეთ კენტი რიცხვები 0-დან 50-მდე

for i in range(1,50,2):
    print(i)

#5)მომხმარებელს შემოატანინეთ მისი გვარი და გამოიტანეთ ამ გვარის თითოეული ასო ცალცალკე

surname = input("enter your surname")

for i in surname:
    print(i)

#6)კომენტარის სახით ახსენით როდის ვიყენებთ For Loop-ს
#for loop-ს ვიყენებთ მშინ როდესაც საჭიროა მოქმედების განმეორება 


#while loops:

#1)გამოიტანეთ რიცხვები 10-დან 15-მდე
i= 0

while i < 15:
    print(i)
    i = i + 1


#2)გამოიტანეთ რიცხვები 50-დან 0-მდე
i = 50

while i > 0:
    print(i)
    i = i - 1


#3)კომენტარის სახით ახსენით რა არის counter ცვლადი და როდის ვიყენებთ While Loop-ს
#Counter ცვლადი  გამოიყენება, რათა დავთვალოთ, რამდენჯერ გაიმეორა ციკლმა მოქმედება. 
# მაგალითად, თუ გვინდა, რომ გავიგოთ რამდენჯერ
#  გაიმეორა for ან while loop-მა, ვზრდით counter-ს თითოეულ iteration-ში

#While loop არის ციკლი, რომელიც პროგრამირებაში გამოიყენება მოქმედებების განმეორებისთვის, სანამ გარკვეული პირობა მართალია


 #4)გამოიტანეთ მხოლოდ ლუწი რიცხვები 10-დან 70-მდე
i = 10

while i < 70:
    print(i)
    i = i + 2


#5)გამოიტანეთ კენტი რიცხვები 25-დან 55-მდე
i = 25

while i < 55:
    print(i)
    i = i + 2
    



        




    
   
   