#1)შექმენით ფუნქცია რომელსაც გადაეცემა ორი რიცხვი შემდეგ დააბრუნეთ მათი ნამრავლი return ის გამოყენებით 
def multiplied(num1, num2):
    return num1 * num2

print(multiplied(5, 5))
#--------------------------------------------------------------------------------------------

#2)ახსენით რაც დღეს გავიარეთ (isalnum,isdigit,islower,isnumeric,isupper,count) მეთოდები თითოეული რას აკეთებს.

#isalnum - 1.ამოწმებს, შეიცავს თუ არა სტრინგი მხოლოდ ანბანისა და ციფრების სიმბოლოებს (არ უნდა იყოს სივრცე ან სხვა სიმბოლო).


#isdigit - ამოწმებს, შეიცავს თუ არა სტრინგი მხოლოდ ციფრებს.

#islower - ამოწმებს, არის თუ არა სტრინგის ყველა ანბანის სიმბოლო მცირე (lowercase) ასო.

#isnumeric - ამოწმებს, შეიცავს თუ არა სტრინგი მხოლოდ რიცხვებით წარმოდგენილ სიმბოლოებს 

#isupper - ამოწმებს, არის თუ არა სტრინგის ყველა ასო დიდი (uppercase).

#count - ითვლის, რამდენჯერ გვხვდება კონკრეტული სიმბოლო ან ქვეწარწერა (substring) სტრინგში.
#-------------------------------------------------------------------------------------------

#3)ასევე ახსენით რას აკეთებს min და max ჩაშენებული ფუნქციები

#1.	min - აბრუნებს სიის ან სხვა კოლექციის ყველაზე მცირე მნიშვნელობას.

#2.	max - აბრუნებს სიის ან სხვა კოლექციის ყველაზე დიდ მნიშვნელობას.



#--------------------------------------------------------------------------------------------