
// 1) კომენტარის სახით ახსენით რაში გამოიყნება addEventListener'ი 

// addEventListener გამოიყენება იმაზე, რომ HTML ელემენტზე "მოვლენა" დავაწეროთ —
// მაგალითად ღილაკზე დაკლიკება, მაუსის გადატარება, კლავიატურის დაჭერა და სხვ.
// როცა ეს მოვლენა მოხდება, შესრულდება შესაბამისი ფუნქცია.


// 2) JS'ში შექმენით ცვლადი სადაც შეინახავთ თქვენთვის სასურველ რიცხვს 10'ის ფარგლებში ასევე შექმენით ერთი ცვლადი სადაც მომხმარებელს შემოატანინებთ
// რიცხვს შემდეგ HTML'ში შექმენით ერთი button რომელსაც წამოიღებთ JS'ში და დაადებთ მოვლენის მსმენელს ღილაკზე დაკლიკების დროს თუ მომხმარებლის რიცხვი 
// დაემთხვევა თქვენს რიცხვს ალერტით გამოიტანეთ "შენ გამოიცანი ჩემი რიცხვი" თუ არა მაშინ "შენ ვერ გამოიცანი ჩემი რიცხვი"

let myNumber = 4; // ჩემი არჩეული რიცხვი

let input = document.getElementById("userGuess");
let button = document.getElementById("checkBtn");

button.addEventListener("click", function() {
    let guess = Number(input.value);
    if (guess === myNumber) {
        alert("შენ გამოიცანი ჩემი რიცხვი");
    } else {
        alert("შენ ვერ გამოიცანი ჩემი რიცხვი");
    }
});






// 4) შექმენით ერთ დივი რომელსაც გაუწერთ თქვენთვის სასურველ სიმაღლეს და სიგანეს ასევე მისცემთ ფერსაც და border-radius
// 'საც შემდეგ კი ამ div'ზე მოახდინეთ მოვლენის მსმენელი და როდესაც მასზე დაკლიკება მოხდება მისი ზომა გაიზარდოს ორჯერ და ასევე შეეცვალოს ფერი 

// 5) ბევრი ივარჯიშეთ მოვლენის მსენელზე და გააკეთეთ მინიმუმ 5 მაგალითი თქვენთვის სასურვლე მოვლენაზე მაგ:"click"... 
// თითოეულს კომენტარის სახით მიუწერეთ განმარტებაც